In [1]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [2]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [3]:
df[["name", "age", "state"]]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [6]:
df[["age", "state", "num_children"]]

   age       state  num_children
0   23        iowa             2
1   78          dc             2
2   22  california             0
3   19       texas             1
4   45  washington             2
5   33          dc             1

In [8]:
df.loc[2:4, "name"]

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [10]:
df.loc[2:4, ["name", "age"]]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [11]:
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [15]:
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [20]:
df.iloc[:,0]

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [17]:
df.iloc[:]

0    0
1    4
2    0
3    5
4    0
5    0
Name: num_pets, dtype: int64

In [18]:
df.loc[:,["age", "state"]] #

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [21]:
df[df["age"] > 30] #find the frame first and then evaluate it

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [22]:
df[df.age > 30] #another way to do it

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [24]:
df[df.num_pets > df.num_children]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [33]:
#older than 40 and owns pets
df[(df.age > 40) & (df.num_pets > 0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [42]:
#drop age and num_children columns
df.drop(["age", "num_children"], axis = 1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [38]:
#after dropping, the original dataframe is unchanged
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [43]:
df.mean()

age             36.666667
num_children     1.333333
num_pets         1.500000
dtype: float64

In [44]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [50]:
df[["age"]].mean()

age    36.666667
dtype: float64

In [51]:
df[["age"]]

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [52]:
df["age"]

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [58]:
type(df["age"])

pandas.core.series.Series

In [60]:
df[["age"]].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [72]:
df["age"] = df["age"].apply(lambda x: x/2)

In [73]:
df

    name   age       state  num_children  num_pets
0   john  23.0        iowa             2         0
1   mary  78.0          dc             2         4
2  peter  22.0  california             0         0
3   jeff  19.0       texas             1         5
4   bill  45.0  washington             2         0
5   lisa  33.0          dc             1         0

In [78]:
df.sort_values(["age"], ascending = True)

    name   age       state  num_children  num_pets
3   jeff  19.0       texas             1         5
2  peter  22.0  california             0         0
0   john  23.0        iowa             2         0
5   lisa  33.0          dc             1         0
4   bill  45.0  washington             2         0
1   mary  78.0          dc             2         4

In [84]:
df[df.name.str.startswith("j")]

   name   age  state  num_children  num_pets
0  john  23.0   iowa             2         0
3  jeff  19.0  texas             1         5

In [87]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)

In [88]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [90]:
p = d.pivot(index="Item", columns="CType", values="USD")

In [91]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$